[
    {
        "id": 1,
        "name": "Gilbert Lungu",
        "country": "Zambia",
        "position": "Country Manager, Zambia",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Gilbert-Lungu-min-1.jpg",
        "description": "A seasoned B2B sales professional with 10 years senior sales management experience, Gilbert has worked in the fields of computer software and hardware sales as well as corporate Internet solution sales. He joined Cellulant in 2017 to lead the Zambia team. He previously held the positions of National Enterprise sales manager at MTN Zambia and most recently Head of Enterprise sales at Airtel Zambia.\n\nHe is a member of the Institute of Directors, Zambia and an associate of the Zambia institute of Marketing.",
        "latitude": -13.133897,
        "longitude": 27.849332,
    },
    {
        "id": 2,
        "name": "Faith Nkatha",
        "country": "Kenya",
        "position": "Country Manager, Kenya",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Faith-Nkatha-min-1.jpg",
        "description": "Ms. Faith Nkatha is a transformational and influential leader and professional in Fintech in the region with over 10 years of experience. She has both broad and deep experiences and knowledge in Innovation, Sales, Business Development, Payments, Partnerships, Leadership, Product development, Strategy, and Culture Management etc. She is known as a strategic thinker with extensive insights into how present trends will translate into the future, and how to prepare organizations for future-readiness.\n\nFaith works as the Country Manager for Cellulant, one of the leading Fintech and payments companies in Africa. Previously, she worked at the Oracle Corporation leading their Digital Transformation efforts for the Public Sector. She has also worked at Sidian Bank as the Director for Strategy, Monitoring, and Transformation where she provided valuable insights and oversight to the Bank’s Marketing, Customer Experience, Retail and Corporate banking operations.",
        "latitude": -1.286389,
        "longitude": 36.817223,
    },
    {
        "id": 3,
        "name": "Jackson Malunda",
        "country": "Malawi",
        "position": "Country Manager, Malawi",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Jackson-Malunda-min-1.jpg",
        "description": "Jackson has over 15 years’ experience in mobile payments, strategic management, fund managements, private equity, business consulting, financial reporting and audit having worked for Global financial service providers in Zambia. He is responsible for the country strategy implementation and running the operation of the business in Malawi. He has a private interest in supporting and promoting entrepreneurs with a stake in Insurance broking, Microfinance, Agency network and Distribution of FMCG products.",
        "latitude": -13.254308,
        "longitude": 34.30152499999997,
    },
    {
        "id": 4,
        "name": "Bathusi Beleme",
        "country": "Botswana",
        "position": "Country Manager, Botswana",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Bathusi-Beleme-min-1.jpg",
        "description": "Bathusi brings on over 7 years’ experience as a seasoned business development professional. Her knowledge of Information and Communication Technology spans across multiple applications and sectors. Over the years she has also gained invaluable experience in marketing.\n\nBathusi was the Sales & Marketing Manager at Broadband Botswana Internet, a leading Internet Service Provider in Botswana. She joined Cellulant in 2018 as a Senior Bank Engagement Manager and now leads the Botswana team. As Country Manager for Botswana, her focus is on identifying growth drivers to achieve Cellulant’s Mission. This involves delivering the very best service to our customers, increasing market share and exploring innovative opportunities in Fintech.",
        "latitude": -22.3285,
        "longitude": 24.6849,
    },
    {
        "id": 5,
        "name": "Jose Silva Salvador",
        "country": "Mozambique",
        "position": "Country Manager, Mozambique",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Jose-Silva-Salvador-min-1.jpg",
        "description": "Jose has over 12 years’ experience in mobile payments, strategic management, business development in Mozambique. His responsible of the country strategy implementation and running the operation of the business. He has private interest in supporting and promoting Business, Banking and FMCG sectors.\nHe has a Bachelor in Business Administration (Pretoria Damelin College). He as a Certificate of Project Management (Wits Business School & ISCTEM Business School).\nBefore joining Cellulant as Business Development Manager, He worked for Ecobank Mozambique as Head of Consumer Banking, prior to this he worked at Vodacom Mozambique as Regional Sales Manager.",
        "latitude": -25.96553,
        "longitude": 32.58322,
    },
    {
        "id": 6,
        "name": "Edwin Kiiru",
        "country": "Tanzania",
        "position": "Country Manager, Tanzania",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Edwin-Kiiru-min-1.jpg",
        "description": "Edwin is a seasoned information technologist, sales executive and thought leader in digital transformation.\nHe has over 15 years’ experience in the information technology field, having worked with multinational companies like Oracle, Microsoft and Dimension Data helping large enterprise institutions in public sector, financial services, telcos and tax authorities across Africa to digitize critical functions like finance, marketing, logistics, customer relationship, as well as adopt cloud computing as a concept and value creator to optimize operations.\nHe joined Cellulant Corporation in 2020 as Head, Global & Regional Merchants to drive commercial partnerships between Cellulant and global customers. In June 2021, he moved to Country Manager role responsible for Tanzania and Uganda. As Country Manager, he is responsible for driving up financial inclusion through expansion of digital payment options for small, medium, and large enterprises.",
        "latitude": -6.369028,
        "longitude": 34.888822000000005,
    },
    {
        "id": 7,
        "name": "Eric Kortey",
        "country": "Ghana",
        "position": "Country Manager, Ghana",
        "picture": "https://www.cellulant.io/wp-content/uploads/2021/06/Eric-Kortey.jpg",
        "description": "Eric is a results-oriented leader with a combined 10 years of experience in the financial sector as well as the Energy sector. He started his career at KPMG Ghana where he rose to become a senior audit associate, with experiences in mining support, petroleum, financial non-banking sector, and NGOs.\n\nHe joined Cellulant Ghana Limited in April 2018 as the Finance Manager and later became a Cluster Finance Manager in June 2020 superintending over 10 markets, namely; Ghana, Cameroon, Morocco, DR Congo, Egypt, Senegal, Cote D’Ivoire, Ethiopia, Tanzania, and Uganda. A role he handled till March 2021.\n\nEric became the Country Manager of Cellulant Ghana Limited in April 2021. He is responsible for implementing and driving the Group’s strategy decisions within the market. He led the market to acquire its first ever regulatory license (i.e PSP enhanced license) without which Cellulant will be non-operational in Ghana under the Payment Systems and Services Act, 2019 Act 987. Under his leadership, the market gained direct integration with Glomobile USSD to power airtime and data bundle in the market.\nHe has a Master of Science degree in Development Finance (University of Ghana), Bachelor of Arts degree in Economics with Mathematics (University of Ghana). He is also a member of ACCA UK and ICA Ghana",
        "latitude": -0.205874,
        "longitude": 5.614818,
    },
    
]

